
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 27 to add, 6 to change, 7 to destroy.</code></pre>

* Create
  * module.storage_account.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account.time_rotating.rotate
  * module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_commondata.time_rotating.rotate
  * module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_data_extract.time_rotating.rotate
  * module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_location.time_rotating.rotate
  * module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_professional.time_rotating.rotate
* Update
  * azurerm_resource_group.rg
  * module.storage_account.azurerm_storage_account.storage_account
  * module.storage_account_rd_commondata.azurerm_storage_account.storage_account
  * module.storage_account_rd_data_extract.azurerm_storage_account.storage_account
  * module.storage_account_rd_location.azurerm_storage_account.storage_account
  * module.storage_account_rd_professional.azurerm_storage_account.storage_account
* Replace
  * module.caseworker-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.judicial-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.storage_account.time_static.pim_expiry
  * module.storage_account_rd_commondata.time_static.pim_expiry
  * module.storage_account_rd_data_extract.time_static.pim_expiry
  * module.storage_account_rd_location.time_static.pim_expiry
  * module.storage_account_rd_professional.time_static.pim_expiry


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod"
        name       = "rd-prod"
      ~ tags       = {
          - "Destroy Me"          = "No"
          - "Team Contact"        = "#referencedata"
          - "Team Name"           = "ReferenceData"
          - "application"         = "referencedata"
          - "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ref-data-support"
          - "environment"         = "production"
          - "lastUpdated"         = "2024-10-18T11:20:06Z"
          - "managedBy"           = "ReferenceData"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.caseworker-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "rd-caseworker-topic-prod"
      + namespace_id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-prod"
      + requires_duplicate_detection            = (known after apply)
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.caseworker-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-prod/topics/rd-caseworker-topic-prod/subscriptions/rd-caseworker-subscription-prod" -> (known after apply)
        name                                      = "rd-caseworker-subscription-prod"
      ~ topic_id                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-prod/topics/rd-caseworker-topic-prod" -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

  # module.judicial-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "rd-judicial-topic-prod"
      + namespace_id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-prod"
      + requires_duplicate_detection            = (known after apply)
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.judicial-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-prod/topics/rd-judicial-topic-prod/subscriptions/rd-judicial-subscription-prod" -> (known after apply)
        name                                      = "rd-judicial-subscription-prod"
      ~ topic_id                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-prod/topics/rd-judicial-topic-prod" -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

  # module.storage_account.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Contributor"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = (known after apply)
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Reader"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = (known after apply)
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = (known after apply)
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprod"
        name                               = "rdprod"
        tags                               = {
            "Destroy Me"          = "No"
            "Team Contact"        = "#referencedata"
            "Team Name"           = "ReferenceData"
            "application"         = "referencedata"
            "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ref-data-support"
            "environment"         = "production"
            "managedBy"           = "ReferenceData"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.storage_account.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage_account.time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 11 -> (known after apply)
      ~ hour    = 11 -> (known after apply)
      ~ id      = "2024-11-11T11:13:01Z" -> (known after apply)
      ~ minute  = 13 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2024-11-11T11:13:01Z" -> (known after apply) # forces replacement
      ~ second  = 1 -> (known after apply)
      ~ unix    = 1731323581 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

  # module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Contributor"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdcommondataprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = (known after apply)
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Reader"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdcommondataprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = (known after apply)
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdcommondataprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = (known after apply)
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_commondata.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdcommondataprod"
        name                               = "rdcommondataprod"
        tags                               = {
            "Destroy Me"          = "No"
            "Team Contact"        = "#referencedata"
            "Team Name"           = "ReferenceData"
            "application"         = "referencedata"
            "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ref-data-support"
            "environment"         = "production"
            "managedBy"           = "ReferenceData"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.storage_account_rd_commondata.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage_account_rd_commondata.time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 11 -> (known after apply)
      ~ hour    = 11 -> (known after apply)
      ~ id      = "2024-11-11T11:13:01Z" -> (known after apply)
      ~ minute  = 13 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2024-11-11T11:13:01Z" -> (known after apply) # forces replacement
      ~ second  = 1 -> (known after apply)
      ~ unix    = 1731323581 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

  # module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Contributor"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rddataextractprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = (known after apply)
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Reader"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rddataextractprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = (known after apply)
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rddataextractprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = (known after apply)
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_data_extract.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rddataextractprod"
        name                               = "rddataextractprod"
        tags                               = {
            "Destroy Me"          = "No"
            "Team Contact"        = "#referencedata"
            "Team Name"           = "ReferenceData"
            "application"         = "referencedata"
            "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ref-data-support"
            "environment"         = "production"
            "managedBy"           = "ReferenceData"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.storage_account_rd_data_extract.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage_account_rd_data_extract.time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 11 -> (known after apply)
      ~ hour    = 11 -> (known after apply)
      ~ id      = "2024-11-11T11:13:01Z" -> (known after apply)
      ~ minute  = 13 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2024-11-11T11:13:01Z" -> (known after apply) # forces replacement
      ~ second  = 1 -> (known after apply)
      ~ unix    = 1731323581 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

  # module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Contributor"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdlocationprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = (known after apply)
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Reader"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdlocationprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = (known after apply)
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdlocationprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = (known after apply)
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_location.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdlocationprod"
        name                               = "rdlocationprod"
        tags                               = {
            "Destroy Me"          = "No"
            "Team Contact"        = "#referencedata"
            "Team Name"           = "ReferenceData"
            "application"         = "referencedata"
            "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ref-data-support"
            "environment"         = "production"
            "managedBy"           = "ReferenceData"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.storage_account_rd_location.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage_account_rd_location.time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 11 -> (known after apply)
      ~ hour    = 11 -> (known after apply)
      ~ id      = "2024-11-11T11:13:01Z" -> (known after apply)
      ~ minute  = 13 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2024-11-11T11:13:01Z" -> (known after apply) # forces replacement
      ~ second  = 1 -> (known after apply)
      ~ unix    = 1731323581 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

  # module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Contributor"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprofessionalprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = (known after apply)
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Reader"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprofessionalprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = (known after apply)
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprofessionalprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = (known after apply)
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_professional.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprofessionalprod"
        name                               = "rdprofessionalprod"
        tags                               = {
            "Destroy Me"          = "No"
            "Team Contact"        = "#referencedata"
            "Team Name"           = "ReferenceData"
            "application"         = "referencedata"
            "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ref-data-support"
            "environment"         = "production"
            "managedBy"           = "ReferenceData"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.storage_account_rd_professional.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage_account_rd_professional.time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 11 -> (known after apply)
      ~ hour    = 11 -> (known after apply)
      ~ id      = "2024-11-11T11:13:01Z" -> (known after apply)
      ~ minute  = 13 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2024-11-11T11:13:01Z" -> (known after apply) # forces replacement
      ~ second  = 1 -> (known after apply)
      ~ unix    = 1731323581 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

Plan: 27 to add, 6 to change, 7 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.storage_account.time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-17T11:13:01Z"
      - rotation_rfc3339 = "2024-11-11T11:13:01Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.storage_account_rd_commondata.time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-17T11:13:01Z"
      - rotation_rfc3339 = "2024-11-11T11:13:01Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.storage_account_rd_data_extract.time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-17T11:13:01Z"
      - rotation_rfc3339 = "2024-11-11T11:13:01Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.storage_account_rd_location.time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-17T11:13:01Z"
      - rotation_rfc3339 = "2024-11-11T11:13:01Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.storage_account_rd_professional.time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-17T11:13:01Z"
      - rotation_rfc3339 = "2024-11-11T11:13:01Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":266,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->